interactuar-afip-wsaa/2-Obtener-TA/token+signs.xml

loginCmsAsync: [
  {
    "loginCmsReturn": "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"yes\"?>\n<loginTicketResponse version=\"1.0\">\n    <header>\n        <source>CN=wsaahomo, O=AFIP, C=AR, SERIALNUMBER=CUIT 33693450239</source>\n        <destination>SERIALNUMBER=CUIT 20437813702, CN=ejempotestin</destination>\n        <uniqueId>216684364</uniqueId>\n        <generationTime>2025-06-08T15:37:39.624-03:00</generationTime>\n        <expirationTime>2025-06-09T03:37:39.624-03:00</expirationTime>\n    </header>\n    <credentials>\n        <token>PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhaG9tbywgTz1BRklQLCBDPUFSLCBTRVJJQUxOVU1CRVI9Q1VJVCAzMzY5MzQ1MDIzOSIgZHN0PSJDTj13c2ZlLCBPPUFGSVAsIEM9QVIiIHVuaXF1ZV9pZD0iNjI5ODMyNTA1IiBnZW5fdGltZT0iMTc0OTQwNzc5OSIgZXhwX3RpbWU9IjE3NDk0NTEwNTkiLz4KICAgIDxvcGVyYXRpb24gdHlwZT0ibG9naW4iIHZhbHVlPSJncmFudGVkIj4KICAgICAgICA8bG9naW4gZW50aXR5PSIzMzY5MzQ1MDIzOSIgc2VydmljZT0id3NmZSIgdWlkPSJTRVJJQUxOVU1CRVI9Q1VJVCAyMDQzNzgxMzcwMiwgQ049ZWplbXBvdGVzdGluIiBhdXRobWV0aG9kPSJjbXMiIHJlZ21ldGhvZD0iMjIiPgogICAgICAgICAgICA8cmVsYXRpb25zPgogICAgICAgICAgICAgICAgPHJlbGF0aW9uIGtleT0iMjA0Mzc4MTM3MDIiIHJlbHR5cGU9IjQiLz4KICAgICAgICAgICAgPC9yZWxhdGlvbnM+CiAgICAgICAgPC9sb2dpbj4KICAgIDwvb3BlcmF0aW9uPgo8L3Nzbz4K</token>\n        <sign>gI42+1gguwlNSXG82RO1K96JJW+VCforMiBUHuH421vT12M5BIiyZoGQI0YBbnU3FhZr/nZk1dSVh05/X+Mg5L6OtFh4zhTPU8ZxHWYUKcq/8Cgpsxnh9iPI9m8AmzkVR1grKiHorMJRlCSR2vZRq4yzq/9uVdSzGEkOyofSVbo=</sign>\n    </credentials>\n</loginTicketResponse>"
  },
  "<?xml version=\"1.0\" encoding=\"utf-8\"?><soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsd=\"http://www.w3.org/2001/XMLSchema\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"><soapenv:Body><loginCmsResponse xmlns=\"http://wsaa.view.sua.dvadac.desein.afip.gov\"><loginCmsReturn>&lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot; standalone=&quot;yes&quot;?&gt;\n&lt;loginTicketResponse version=&quot;1.0&quot;&gt;\n    &lt;header&gt;\n        &lt;source&gt;CN=wsaahomo, O=AFIP, C=AR, SERIALNUMBER=CUIT 33693450239&lt;/source&gt;\n        &lt;destination&gt;SERIALNUMBER=CUIT 20437813702, CN=ejempotestin&lt;/destination&gt;\n        &lt;uniqueId&gt;216684364&lt;/uniqueId&gt;\n        &lt;generationTime&gt;2025-06-08T15:37:39.624-03:00&lt;/generationTime&gt;\n        &lt;expirationTime&gt;2025-06-09T03:37:39.624-03:00&lt;/expirationTime&gt;\n    &lt;/header&gt;\n    &lt;credentials&gt;\n        &lt;token&gt;PD94bWwgdmVyc2lvbj0iMS4wIiBlbmNvZGluZz0iVVRGLTgiIHN0YW5kYWxvbmU9InllcyI/Pgo8c3NvIHZlcnNpb249IjIuMCI+CiAgICA8aWQgc3JjPSJDTj13c2FhaG9tbywgTz1BRklQLCBDPUFSLCBTRVJJQUxOVU1CRVI9Q1VJVCAzMzY5MzQ1MDIzOSIgZHN0PSJDTj13c2ZlLCBPPUFGSVAsIEM9QVIiIHVuaXF1ZV9pZD0iNjI5ODMyNTA1IiBnZW5fdGltZT0iMTc0OTQwNzc5OSIgZXhwX3RpbWU9IjE3NDk0NTEwNTkiLz4KICAgIDxvcGVyYXRpb24gdHlwZT0ibG9naW4iIHZhbHVlPSJncmFudGVkIj4KICAgICAgICA8bG9naW4gZW50aXR5PSIzMzY5MzQ1MDIzOSIgc2VydmljZT0id3NmZSIgdWlkPSJTRVJJQUxOVU1CRVI9Q1VJVCAyMDQzNzgxMzcwMiwgQ049ZWplbXBvdGVzdGluIiBhdXRobWV0aG9kPSJjbXMiIHJlZ21ldGhvZD0iMjIiPgogICAgICAgICAgICA8cmVsYXRpb25zPgogICAgICAgICAgICAgICAgPHJlbGF0aW9uIGtleT0iMjA0Mzc4MTM3MDIiIHJlbHR5cGU9IjQiLz4KICAgICAgICAgICAgPC9yZWxhdGlvbnM+CiAgICAgICAgPC9sb2dpbj4KICAgIDwvb3BlcmF0aW9uPgo8L3Nzbz4K&lt;/token&gt;\n        &lt;sign&gt;gI42+1gguwlNSXG82RO1K96JJW+VCforMiBUHuH421vT12M5BIiyZoGQI0YBbnU3FhZr/nZk1dSVh05/X+Mg5L6OtFh4zhTPU8ZxHWYUKcq/8Cgpsxnh9iPI9m8AmzkVR1grKiHorMJRlCSR2vZRq4yzq/9uVdSzGEkOyofSVbo=&lt;/sign&gt;\n    &lt;/credentials&gt;\n&lt;/loginTicketResponse&gt;\n</loginCmsReturn></loginCmsResponse></soapenv:Body></soapenv:Envelope>",
  null,
  "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:xsi=\"http://www.w3.org/2001/XMLSchema-instance\"  xmlns:impl=\"https://wsaahomo.afip.gov.ar/ws/services/LoginCms\" xmlns:intf=\"https://wsaahomo.afip.gov.ar/ws/services/LoginCms\" xmlns:tns1=\"http://wsaa.view.sua.dvadac.desein.afip.gov\"><soap:Body><tns1:loginCms xmlns:tns1=\"http://wsaa.view.sua.dvadac.desein.afip.gov\" xmlns=\"http://wsaa.view.sua.dvadac.desein.afip.gov\"><tns1:in0>MIIGvwYJKoZIhvcNAQcCoIIGsDCCBqwCAQExDTALBglghkgBZQMEAgEwgesGCSqG\r\nSIb3DQEHAaCB3QSB2jxsb2dpblRpY2tldFJlcXVlc3Q+PGhlYWRlcj48dW5pcXVl\r\nSWQ+MjUwNjA4MTU0MzwvdW5pcXVlSWQ+PGdlbmVyYXRpb25UaW1lPjIwMjUtMDYt\r\nMDhUMTg6MzM6MzhaPC9nZW5lcmF0aW9uVGltZT48ZXhwaXJhdGlvblRpbWU+MjAy\r\nNS0wNi0wOFQxODo1MzozOFo8L2V4cGlyYXRpb25UaW1lPjwvaGVhZGVyPjxzZXJ2\r\naWNlPndzZmU8L3NlcnZpY2U+PC9sb2dpblRpY2tldFJlcXVlc3Q+oIIDUDCCA0ww\r\nggI0oAMCAQICCHX1dnkITCh5MA0GCSqGSIb3DQEBDQUAMDgxGjAYBgNVBAMMEUNv\r\nbXB1dGFkb3JlcyBUZXN0MQ0wCwYDVQQKDARBRklQMQswCQYDVQQGEwJBUjAeFw0y\r\nNTA2MDgxNjA2MzZaFw0yNzA2MDgxNjA2MzZaMDIxFTATBgNVBAMMDGVqZW1wb1Rl\r\nc3RpbjEZMBcGA1UEBRMQQ1VJVCAyMDQzNzgxMzcwMjCCASIwDQYJKoZIhvcNAQEB\r\nBQADggEPADCCAQoCggEBAMUuM1guHkwrTfuJjAv67BvyL05JBfc+XHr0RlD/Dmc4\r\nxRUVZmhf82NunFBYeBfUA7GNT08LqDij4jsCmH958uYmPXmOPw1dxuxpNsdppEJx\r\nxXM8C1KT2J9XBua1mXh9V54ZCipUJjhxrKDU5zK5jn4Yjjh8Zrrydva1IeDBbkz9\r\ncZpJhcmP3vqAEiyuueWH5LyKuLky4ENiVDX3xBPcdQXQ4O7InEnY+0u4x7LOB5M/\r\nu1vjvUoL+b0rVb2AaUxLWhQY2hEFY/76DcOIr4Mw8g4o8TDlIHgRBo5xnTTT8SDY\r\nAE6ZhefFY0y6Mc/xNQQ9RTvPW3TP6fagyHFdi6WIhmsCAwEAAaNgMF4wDAYDVR0T\r\nAQH/BAIwADAfBgNVHSMEGDAWgBSzstP//em63t6NrxEhnNYgffJPbzAdBgNVHQ4E\r\nFgQUGKj2GwNPysYNwj+nbAhAsoiOXoowDgYDVR0PAQH/BAQDAgXgMA0GCSqGSIb3\r\nDQEBDQUAA4IBAQCrxFmwOaemLgYndbfLviTIRKErLQ7zA1FJ9iSTl5oqKeRadBWS\r\nM4hkHWRypkXu/+5TmzQyIjSQ2OYrZf77fNDd12CIs1wWU0CFK+xiIhWZJuJFZpor\r\ndblch5gy55D84inNEFJkE97/A0l4pMP/h+ZdiIFz4uqzuAv7Cdue/63+3kAx0HQc\r\n2/x3ZDav6VQZwyTZiSvgWthfp1F8aBJ011DIYXx3MdfePFgyDyBcO1ERZhszKXnc\r\nb8Zqr1/reTUtEhi5KzTwT7/W+oCErwdHWu3cbfHzJ3nQDv2zTLZ7X+4rrEZJdF0B\r\nmYljF+I10GiKSHx22uWFGvCACCQvn6H8PlbXMYICVDCCAlACAQEwRDA4MRowGAYD\r\nVQQDDBFDb21wdXRhZG9yZXMgVGVzdDENMAsGA1UECgwEQUZJUDELMAkGA1UEBhMC\r\nQVICCHX1dnkITCh5MAsGCWCGSAFlAwQCAaCB5DAYBgkqhkiG9w0BCQMxCwYJKoZI\r\nhvcNAQcBMBwGCSqGSIb3DQEJBTEPFw0yNTA2MDgxODQzMzhaMC8GCSqGSIb3DQEJ\r\nBDEiBCBz9sk/F0Q+jDQjc+nbr9xou/h0HlCVrPp+ltFoqi0WSjB5BgkqhkiG9w0B\r\nCQ8xbDBqMAsGCWCGSAFlAwQBKjALBglghkgBZQMEARYwCwYJYIZIAWUDBAECMAoG\r\nCCqGSIb3DQMHMA4GCCqGSIb3DQMCAgIAgDANBggqhkiG9w0DAgIBQDAHBgUrDgMC\r\nBzANBggqhkiG9w0DAgIBKDANBgkqhkiG9w0BAQEFAASCAQBaJ21smMie2sJw4G7R\r\n+4OBddA4WYFvFWWWAijoWV+RqEVYNP2xMfnNRtCr1NPYFh11AnbhzG9o8OxcwNMR\r\n6pMbv6h9bHnhufB5h3r4TrteH2FfyqS4sBF6/tbfvLDOGCiD6loSh3A22L+1QBDp\r\nEnOzXqaDi5UtaNS9jn6ZKumQH9wRw4xGEleucCw4/MIQqpEcB9hSuVSUFjcQO8sf\r\nNErznDDAYbgcI6L3W2XwCjou/kyEM20pbuMGkwtfwzYsOyllDlndU55UWz1lM7gr\r\nWPNTnrWhDphY3l/0j1EfI8O9idEm0xT4yEBFM04kXraNEwdLUOqWQoW3ctFbZMbT\r\nnzGa\r\n</tns1:in0></tns1:loginCms></soap:Body></soap:Envelope>",
  null
]